Autodesk.Revit.DB.LinePattern.SetSegments(System.Collections.Generic.IList{Autodesk.Revit.DB.LinePatternSegment})
Sets the sequence of segments that defines this line pattern.
lineSegs:
The sequence of segments.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LinePattern.GetSegments
Gets the sequence of segments that defines this line pattern.
Returns:
The sequence of segments.

Autodesk.Revit.DB.LinePattern.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LinePattern.Name
Line pattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.LinePattern.#ctor(System.String)
Creates a line pattern with given name.
name:
The name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LinePattern.#ctor
Creates a simple line pattern.

Autodesk.Revit.DB.LinePattern
Represents a line pattern definition.
Remarks:
A line pattern is a pattern of dashes and dots used to control the way the lines of an object are drawn in Revit.
Line patterns are used in the definition of GraphicsStyle objects.
A line pattern is defined by a repeating sequence segments.
Each segment is a dash, a dot or a space.
A line pattern definition must contain an even number of segments, starting with a visible segment (a dash or a dot) and alternating between visible segments and spaces.